# HasValueFilterRule Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HasValueFilterRule Class
Members See Also
---
Tests whether an element's parameter has a value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public class HasValueFilterRule : ParameterValuePresenceRule
```

Visual Basic
---
```text
Public Class HasValueFilterRule _
	Inherits ParameterValuePresenceRule
```

Visual C++
---
```text
public ref class HasValueFilterRule : public ParameterValuePresenceRule
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterRule Autodesk.Revit.DB..::..ParameterValuePresenceRule Autodesk.Revit.DB..::..HasValueFilterRule
# See Also
HasValueFilterRule Members
Autodesk.Revit.DB Namespace